#pragma once




#define __int8   char
#define __int16  short
#define __int32  int
#define __int64  long long

typedef unsigned __int64 QWORD;
//typedef unsigned int     DWORD;
typedef __int64          LONG_PTR;
typedef unsigned __int64 UINT_PTR;
typedef long LONG;

/* =======================
   Generic pointer types
   ======================= */
typedef void* PVOID;

/* =======================
   Handle forward decls
   ======================= */
struct HWND__;
struct HMENU__;

/* =======================
   Handle typedefs (IDA style)
   ======================= */
typedef struct HWND__* HWND;
typedef struct HMENU__* HMENU;

/* =======================
   Dummy handle structs
   ======================= */
//struct HWND__ { int unused; };
//struct HMENU__ { int unused; };

/* ============================================================
   Forward declarations (our internal structs)
   ============================================================ */
struct _TAGWND_USER;
struct _TAGWND_KERNEL;

struct _WND_UNK_0x10;
struct _WND_UNK_0x18;

struct _MENU_USER;
struct _MENU_UNK0_0x18;
struct _MENU_UNK1_0x28;
struct _MENU_ITEMS;
struct _MENU_KERNEL;

struct _TEB_BOX;
struct _EPROCESS_BOX;

struct tagSERVERINFO;
struct tagMENUBARINFO;
struct tagRECT;
/* ============================================================
   ptagWND(user layer)
   ============================================================ */

   /*
       ptagWND + 0x10
           0x00 pTEB
               0x220 pEPROCESS
   */
struct _EPROCESS_BOX
{
    /* 0x00 */ PVOID pEPROCESS;
};

struct _TEB_BOX
{
    /* 0x000 */ __int8 _pad_000[0x220];
    /* 0x220 */ struct _EPROCESS_BOX* pEprocessBox;
};

struct _WND_UNK_0x10
{
    /* 0x00 */ struct _TEB_BOX* pTEB;
};

/*
    ptagWND + 0x18
        0x80 kernel desktop heap base
*/
struct _WND_UNK_0x18
{
    /* 0x00 */ __int8 _pad_000[0x80];
    /* 0x80 */ PVOID  KernelDesktopHeapBase;
};

/*
    ptagWND(user)
*/
struct _TAGWND_USER
{
    /* 0x00 */ __int8 _pad_000[0x8];
    signed __int32 RefCount; // ref count for user/kernel sync
    int         Padding;  // padding to align next pointer
    /* 0x10 */ struct _WND_UNK_0x10* unk_0x10;

    /* 0x18 */ struct _WND_UNK_0x18* unk_0x18;

    /* 0x20 */ __int8 _pad_020[0x08];

    /* 0x28 */ struct _TAGWND_KERNEL* ptagWNDk;

    /* 0x30 */ __int8 _pad_030[0x60];

    /* 0x90 */ struct _MENU_USER* spMenu;
};

/* ============================================================
   ptagWNDk(kernel layer)
   ============================================================ */

struct _TAGWND_KERNEL
{
    /* 0x000 */ HWND  hwnd;

    /* 0x008 */ QWORD KernelDesktopHeapBaseOffset;

    /* 0x010 */ __int8 _pad_010[0x08];

    /* 0x018 */ DWORD dwStyle;
    /* 0x01C */ DWORD _pad_01C;

    /* 0x020 */ __int8 _pad_020[0x38];

    /* 0x058 */ __int32 rcWindowLeft;
    /* 0x05C */ __int32 rcWindowTop;

    /* 0x060 */ __int8 _pad_060[0x38];

    /* 0x098 */ PVOID spMenu_uninitialized;

    /* 0x0A0 */ __int8 _pad_0A0[0x28];

    /* 0x0C8 */ DWORD cbWndExtra;
    /* 0x0CC */ DWORD _pad_0CC;

    /* 0x0D0 */ __int8 _pad_0D0[0x18];

    /* 0x0E8 */ DWORD dwExtraFlag;
    /* 0x0EC */ DWORD _pad_0EC;

    /* 0x0F0 */ __int8 _pad_0F0[0x38];

    /* 0x128 */ PVOID pExtraBytes;
};

/* ============================================================
   spMenu(user layer)
   ============================================================ */

   /*
       spMenu + 0x18
           0x100
               0x00 pEPROCESS
   */
struct _MENU_UNK0_0x18
{
    /* 0x000 */ __int8 _pad_000[0x100];
    /* 0x100 */ struct _EPROCESS_BOX* pEprocessBox;
};

/*
    spMenu + 0x28
        0x2C cItems
*/
struct _MENU_UNK1_0x28
{
    /* 0x00 */ __int8 _pad_000[0x2C];
    /* 0x2C */ DWORD  cItems;
};

/*
    rgItems
        0x00 unknown (for exploit)
*/
struct _MENU_ITEMS
{
    /* 0x00 */ PVOID unknown_for_exploit;
};

/*
    spMenuk
        0x00 pSelf
*/
struct  _MENU_KERNEL
{
    /* 0x00 */ struct _MENU_USER* pSelf;
};

/*
    spMenu(user)
*/
struct _MENU_USER
{
    /* 0x00 */ HMENU hMenu;

    /* 0x08 */ DWORD refCount;

    /* 0x0C */ __int8 _pad_00C[0x0C];

    /* 0x18 */ struct _MENU_UNK0_0x18* unk0_0x18;

    /* 0x20 */ __int8 _pad_020[0x08];

    /* 0x28 */ struct _MENU_UNK1_0x28* unk1_0x28;

    /* 0x30 */ __int8 _pad_030[0x10];

    /* 0x40 */ DWORD unknown2_check;
    /* 0x44 */ DWORD unknown3_check;

    /* 0x48 */ __int8 _pad_048[0x08];

    /* 0x50 */ struct _TAGWND_USER* ptagWND;

    /* 0x58 */ struct _MENU_ITEMS* rgItems;

    /* 0x60 */ __int8 _pad_060[0x38];

    /* 0x98 */ struct _MENU_KERNEL* spMenuk;
};



struct tagSERVERINFO {
    DWORD dwSRVIFlags;
    DWORD cHandleEntries;       // gSharedInfo.psi->cHandleEntries (最大 GUI HANDLE 数量)
    // 各种内核回调函数表指针
    PVOID mpFnidPfn[32];
    PVOID aStoCidPfn[7];
    PVOID mpFnid_serverCBWndProc[31];
    // apfnClientA / apfnClientW ... 内核 ↔ 用户 回调表
    // PFNCLIENT apfnClientA[MAX_CLIENTFUNCS];
    // PFNCLIENT apfnClientW[MAX_CLIENTFUNCS];
    // PFNCLIENTWORKER apfnClientWorker[MAX_CLIENTFUNCS];
    // WORD cbHandleTable;          // HANDLE 表大小等
    // WORD atomSysClass[25];
};

